###################################################################################################
#Вычисление относительного пути от места запуска к каталогу, содержащему этот makefile
###################################################################################################
ROOT := $(patsubst %/,%,$(dir $(word $(words $(MAKEFILE_LIST)),$(MAKEFILE_LIST))))

ifeq (,$(BUILD_SCRIPT))
  BUILD_SCRIPT ?= $(ROOT)/build/make-main.mak
endif

###################################################################################################
#Проверка наличия makefile на папку выше
###################################################################################################
ifneq (,$(wildcard ../$(word $(words $(MAKEFILE_LIST)),$(MAKEFILE_LIST))))
  include ../$(word $(words $(MAKEFILE_LIST)),$(MAKEFILE_LIST))
else

###################################################################################################
#Подключение скрипта сборки
###################################################################################################
  include $(BUILD_SCRIPT)
endif
