#ifndef RENDER_MID_LEVEL_COMMON_HEADER
#define RENDER_MID_LEVEL_COMMON_HEADER

#include <mathlib.h>

namespace mid_level
{

///////////////////////////////////////////////////////////////////////////////////////////////////
///Область вывода
///////////////////////////////////////////////////////////////////////////////////////////////////
struct Viewport
{
  int    x;      //абсцисса левого верхнего угла области
  int    y;      //ордината левого верхнего угла области
  size_t width;  //ширина области
  size_t height; //высота области
};

///////////////////////////////////////////////////////////////////////////////////////////////////
///Базовый класс для визуализируемых пакетов
///////////////////////////////////////////////////////////////////////////////////////////////////
struct Frame
{
  ITexture*     render_target;                   //целевой буфер цвета
  ITexture*     depth_stencil_target;            //целевой буфер попиксельного отсечения
  Viewport      viewport;                        //параметры области вывода
  bool          need_clear_color_buffer;         //нужно ли очищать буфер цвета
  bool          need_clear_depth_stencil_buffer; //нужно ли очищать буфер попиксельного отсечения
  math::vec4f   clear_color;                     //цвет очистки
  float         clear_depth;                     //значение глубины, используемое при очистке
  unsigned char clear_stencil;                   //значение трафарета, используемое при очистке
};

}

#endif
