#ifndef RENDER_LOW_LEVEL_SHADER_HEADER
#define RENDER_LOW_LEVEL_SHADER_HEADER

#include <render/low_level/common.h>

namespace render
{

namespace low_level
{

///////////////////////////////////////////////////////////////////////////////////////////////////
///ƒескриптор шейдера
///////////////////////////////////////////////////////////////////////////////////////////////////
struct ShaderDesc
{
  const char* name;             //им€ шейдера (дл€ вывода диагностических сообщений)
  size_t      source_code_size; //длина буфера с исходным кодом шейдера (size_t (-1) - длина определ€етс€ автоматически)
  const char* source_code;      //буфер с исходным кодом
  const char* profile;          //профиль шейдера
  const char* options;          //опции компил€ции (в зависимости от профил€)
};

///////////////////////////////////////////////////////////////////////////////////////////////////
///Ўейдер
///////////////////////////////////////////////////////////////////////////////////////////////////
class IProgram: virtual public IObject
{
};

}

}

#endif
